{"artOfWar":
  [
      {
      "chapter":1,
      "title":"Laying Plans",
      "strategies":[
        {
          "lineNumber":1,
          "text":"The art of war is of vital importance to the State."
        },
        {
          "lineNumber":2,
          "text":"It is a matter of life and death, a road either to safety or to ruin. Hence it is a subject of inquiry which can on no account be neglected."
        },
        {
          "lineNumber":3,
          "text":"The art of war, then, is governed by five constant factors, to be taken into account in one's deliberations,when seeking to determine the conditions obtaining in the field."
        },
        {
          "lineNumber":4,
          "text":"These are: (1) The Moral Law; (2) Heaven; (3) Earth; (4) The Commander; (5) Method and discipline."
        },
        {
          "lineNumber":5,
          "text":"The MORAL LAW causes the people to be in complete accord with their ruler, so that they will follow him regardless of their lives, undismayed by any danger"
        },
        {
          "lineNumber":7,
          "text":"HEAVEN signifies night and day, cold and heat, times and seasons"
        },
        {
          "lineNumber":8,
          "text":"EARTH comprises distances, great and small; danger and security; open ground and narrow passes; the chances of life and death."
        },
        {
          "lineNumber":9,
          "text":"The COMMANDER stands for the virtues of wisdom, sincerely, benevolence, courage, and strictness"
        },
        {
          "lineNumber":10,
          "text":"By METHOD AND DISCIPLINE are to be understood the marshalling of an army in its proper subdivisions the graduations of rank among officers, the maintenance of roads by which supplies may reach the army, and the control of military expenditure"
        },
        {
          "lineNumber":11,
          "text":"These five heads should be familiar to every general: he who knows them will be victorious; he who knows them not will fail"
        },
        {
          "lineNumber":12,
          "text":"Therefore, in your deliberations, when seeking to determine the military conditions, let them be made the basis of a comparison, in this wise: --"
        },
        {
          "lineNumber":13,
          "text":["(1) Which of the two sovereigns is imbued with the MORAL LAW?",  
                  "(2) Which of the two COMMANDERS has most ability",
                  "(3) With whom lie the advantages derived from HEAVEN AND EARTH?",
                  "(4) On which side is DISCIPLINE most rigorously enforced?",
                  "(5) Which army is stronger?",
                  "(6) On which side are officers and men more highly trained?",
                  "(7) In which army is there the greater constancy both in reward and punishment?"]
        },
        {
          "lineNumber":14,
          "text":"By means of these seven considerations I can forecast victory or defeat."
        },
        {
          "lineNumber":15,
          "text":"The general that hearkens to my counsel and acts upon it, will conquer: --let such a one be retained in command! The general that hearkens not to my counsel nor acts upon it, will suffer defeat: --let such a one be dismissed!"
        },
        {
          "lineNumber":16,
          "text":"While heading the profit of my counsel, avail yourself also of any helpful circumstances over and beyond the ordinary rules"
        },
        {
          "lineNumber":17,
          "text":"According as circumstances are favorable, one should modify one's plans."
        },
        {
          "lineNumber":18,
          "text":"All warfare is based on deception."
        },
        {
          "lineNumber":19,
          "text":"Hence, when able to attack, we must seem unable; when using our forces, we must seem inactive; when we are near, we must make the enemy believe we are far away; when far away, we must make him believe we are near."
        },
        {
          "lineNumber":20,
          "text":"Hold out baits to entice the enemy. Feign disorder, and crush him."
        },
        {
          "lineNumber":21,
          "text":"If he is secure at all points, be prepared for him. If he is in superior strength, evade him."
        },
        {
          "lineNumber":22,
          "text":"If your opponent is of choleric temper, seek to irritate him. pretend to be weak, that he may grow arrogant."
        },
        {
          "lineNumber":23,
          "text":"If he is taking his ease, give him no rest."
        },
        {
          "lineNumber":24,
          "text":"Attach him where he is unprepared, appear where you are not expected."
        },
        {
          "lineNumber":25,
          "text":"These military devices, leading to victory, must not be divulged beforehand."
        },
        {
          "lineNumber":26,
          "text":"Now the general who wins a battle makes many calculations in his temple ere the battle is fought"
        }
        
      ]
    },
    {
      "chapter":2,
      "title":"Waging War",
      "content":[
        {
          "lineNumber":1,
          "text":"Sun Tzu said: In the operations of war, where there are in the field a thousand swift chariots, as many heavy chariots, and a hundred thousand mail-clad soldiers,."
        },
        {
          "lineNumber":2,
          "text":"When you engage in actual fighting, if victory is long in coming, then men's weapons will grow dull and their ardor will be damped. If you lay siege to a town, you will exhaust your strength"
        },
        {
          "lineNumber":3,
          "text":"Again, if the campaign is protracted, the resources of the State will not be equal to the strain"
        },
        {
          "lineNumber":4,
          "text":"Now, when your weapons are dulled, your ardor damped, your strength exhausted and your treasure spent, other chieftains will spring up to take advantage of your extremity. Then no man, however wise, will be able to avert the consequences that must ensue"
        },
        {
          "lineNumber":5,
          "text":"Thus, though we have heard of stupid haste in war, cleverness has never been seen associated with long delays"
        },
        {
          "lineNumber":7,
          "text":"It is only one who is thoroughly acquainted with the evils of war that can thoroughly understand the profitable way of carrying it on."
        },
        {
          "lineNumber":8,
          "text":"The skillful soldier does not raise a second levy, neither are his supply-wagons loaded more than twice"
        },
        {
          "lineNumber":9,
          "text":"Bring war material with your from home, but forage on the enemy. Thus the army will have food enough for its needs."
        },
        {
          "lineNumber":10,
          "text":"Poverty of the State exchequer causes an army to be maintained by contributions from a distance. Contributing to maintain an army at a distance causes the people to be impoverished."
        },
        {
          "lineNumber":11,
          "text":"On the other hand, the proximity of an army causes prices to go up; and high prices cause the people's substance to be drained away."
        },
        {
          "lineNumber":12,
          "text":"When their substance is drained away, the peasantry will be afflicted by heavy exactions."
        },
        {
          "lineNumber":13,
          "text":""
        },
        {
          "lineNumber":14,
          "text":""
        },
        {
          "lineNumber":15,
          "text":""
        },
        {
          "lineNumber":16,
          "text":""
        },
        {
          "lineNumber":17,
          "text":""
        },
        {
          "lineNumber":18,
          "text":""
        },
        {
          "lineNumber":19,
          "text":""
        },
        {
          "lineNumber":20,
          "text":""
        }       
      ]
    },
    {
      "chapter":3,
      "title":"Attack by Stratagem",
      "content":[
        {
          "lineNumber":1,
          "text":"Sun Tzu said: In the practical art of war, the best thing of all is to take the enemy's country whole and intact; to shatter and destroy it is not so good. So, too, it is better to recapture an army entire than to destroy it, to capture a regiment, a detachment or a company entire than to destroy them."
        },
        {
          "lineNumber":19,
          "text":""
        },
        {
          "lineNumber":19,
          "text":""
        },
        {
          "lineNumber":19,
          "text":""
        },
        {
          "lineNumber":19,
          "text":""
        },
        {
          "lineNumber":19,
          "text":""
        },
        {
          "lineNumber":19,
          "text":""
        }        
      ]
    }
  ]
}