{"artOfWar":
  [
      {
      "chapter":1,
      "title":"Laying Plans",
      "strategies":[
        {
          "lineNumber":1,
          "text":"The art of war is of vital importance to the State."
        },
        {
          "lineNumber":2,
          "text":"It is a matter of life and death, a road either to safety or to ruin. Hence it is a subject of inquiry which can on no account be neglected."
        },
        {
          "lineNumber":3,
          "text":"The art of war, then, is governed by five constant factors, to be taken into account in one's deliberations,when seeking to determine the conditions obtaining in the field."
        },
        {
          "lineNumber":4,
          "text":"These are: (1) The Moral Law; (2) Heaven; (3) Earth; (4) The Commander; (5) Method and discipline."
        },
        {
          "lineNumber":5,
          "text":"The MORAL LAW causes the people to be in complete accord with their ruler, so that they will follow him regardless of their lives, undismayed by any danger"
        },
        {
          "lineNumber":7,
          "text":"HEAVEN signifies night and day, cold and heat, times and seasons"
        },
        {
          "lineNumber":8,
          "text":"EARTH comprises distances, great and small; danger and security; open ground and narrow passes; the chances of life and death."
        },
        {
          "lineNumber":9,
          "text":"The COMMANDER stands for the virtues of wisdom, sincerely, benevolence, courage, and strictness"
        },
        {
          "lineNumber":10,
          "text":"By METHOD AND DISCIPLINE are to be understood the marshalling of an army in its proper subdivisions the graduations of rank among officers, the maintenance of roads by which supplies may reach the army, and the control of military expenditure"
        },
        {
          "lineNumber":11,
          "text":"These five heads should be familiar to every general: he who knows them will be victorious; he who knows them not will fail"
        },
        {
          "lineNumber":12,
          "text":"Therefore, in your deliberations, when seeking to determine the military conditions, let them be made the basis of a comparison, in this wise: --"
        },
        {
          "lineNumber":13,
          "text":["(1) Which of the two sovereigns is imbued with the MORAL LAW?",  
                  "(2) Which of the two COMMANDERS has most ability",
                  "(3) With whom lie the advantages derived from HEAVEN AND EARTH?",
                  "(4) On which side is DISCIPLINE most rigorously enforced?",
                  "(5) Which army is stronger?",
                  "(6) On which side are officers and men more highly trained?",
                  "(7) In which army is there the greater constancy both in reward and punishment?"]
        },
        {
          "lineNumber":14,
          "text":"By means of these seven considerations I can forecast victory or defeat."
        },
        {
          "lineNumber":15,
          "text":"The general that hearkens to my counsel and acts upon it, will conquer: --let such a one be retained in command! The general that hearkens not to my counsel nor acts upon it, will suffer defeat: --let such a one be dismissed!"
        },
        {
          "lineNumber":16,
          "text":"While heading the profit of my counsel, avail yourself also of any helpful circumstances over and beyond the ordinary rules"
        },
        {
          "lineNumber":17,
          "text":"According as circumstances are favorable, one should modify one's plans."
        },
        {
          "lineNumber":18,
          "text":"All warfare is based on deception."
        },
        {
          "lineNumber":19,
          "text":"Hence, when able to attack, we must seem unable; when using our forces, we must seem inactive; when we are near, we must make the enemy believe we are far away; when far away, we must make him believe we are near."
        },
        {
          "lineNumber":20,
          "text":"Hold out baits to entice the enemy. Feign disorder, and crush him."
        },
        {
          "lineNumber":21,
          "text":"If he is secure at all points, be prepared for him. If he is in superior strength, evade him."
        },
        {
          "lineNumber":22,
          "text":"If your opponent is of choleric temper, seek to irritate him. pretend to be weak, that he may grow arrogant."
        },
        {
          "lineNumber":23,
          "text":"If he is taking his ease, give him no rest."
        },
        {
          "lineNumber":24,
          "text":"Attach him where he is unprepared, appear where you are not expected."
        },
        {
          "lineNumber":25,
          "text":"These military devices, leading to victory, must not be divulged beforehand."
        },
        {
          "lineNumber":26,
          "text":"Now the general who wins a battle makes many calculations in his temple ere the battle is fought"
        }
        
      ]
    },
    {
      "chapter":2,
      "title":"Waging War",
      "content":[
        {
          "lineNumber":1,
          "text":"Sun Tzu said: In the operations of war, where there are in the field a thousand swift chariots, as many heavy chariots, and a hundred thousand mail-clad soldiers,."
        },
        {
          "lineNumber":2,
          "text":"When you engage in actual fighting, if victory is long in coming, then men's weapons will grow dull and their ardor will be damped. If you lay siege to a town, you will exhaust your strength"
        },
        {
          "lineNumber":3,
          "text":"Again, if the campaign is protracted, the resources of the State will not be equal to the strain"
        },
        {
          "lineNumber":4,
          "text":"Now, when your weapons are dulled, your ardor damped, your strength exhausted and your treasure spent, other chieftains will spring up to take advantage of your extremity. Then no man, however wise, will be able to avert the consequences that must ensue"
        },
        {
          "lineNumber":5,
          "text":"Thus, though we have heard of stupid haste in war, cleverness has never been seen associated with long delays"
        },
        {
          "lineNumber":7,
          "text":"It is only one who is thoroughly acquainted with the evils of war that can thoroughly understand the profitable way of carrying it on."
        },
        {
          "lineNumber":8,
          "text":"The skillful soldier does not raise a second levy, neither are his supply-wagons loaded more than twice"
        },
        {
          "lineNumber":9,
          "text":"Bring war material with your from home, but forage on the enemy. Thus the army will have food enough for its needs."
        },
        {
          "lineNumber":10,
          "text":"Poverty of the State exchequer causes an army to be maintained by contributions from a distance. Contributing to maintain an army at a distance causes the people to be impoverished."
        },
        {
          "lineNumber":11,
          "text":"On the other hand, the proximity of an army causes prices to go up; and high prices cause the people's substance to be drained away."
        },
        {
          "lineNumber":12,
          "text":"When their substance is drained away, the peasantry will be afflicted by heavy exactions."
        },
        {
          "lineNumber":13,
          "text":"With this loss of substance and exhaustion of strength, the homes of the people will be stripped bare, and three-tenths of their income will be dissipated;"
        },
        {
          "lineNumber":14,
          "text":"Hence a wise general makes a point of foraging on the enemy. One cartload of the enemy's provisions is equivalent to twenty of one's own, and likewise a single PICUL of his provender is equivalent to twenty from one's own store."
        },
        {
          "lineNumber":15,
          "text":"Now in order to kill the enemy, our men must be roused to anger; that there may be advantage from defeating the enemy, they must have their rewards."
        },
        {
          "lineNumber":16,
          "text":"Therefore in chariot fighting, when ten or more chariots have been taken, those should be rewarded who took the first. Our own flags should be substituted for those of the enemy, and the chariots mingled and used in conjunction with ours. The captured soldiers should be kindly treated and kept."
        },
        {
          "lineNumber":17,
          "text":"This is called, using the conquered foe to augment one's own strength."
        },
        {
          "lineNumber":18,
          "text":"In war, then, let your great object be victory, not lengthy campaigns."
        },
        {
          "lineNumber":19,
          "text":"Thus it may be known that the leader of armies is the arbiter of the people's fate, the man on whom it depends whether the nation shall be in peace or in peril."
        }       
      ]
    },
    {
      "chapter":3,
      "title":"Attack by Stratagem",
      "content":[
        {
          "lineNumber":1,
          "text":"Sun Tzu said: In the practical art of war, the best thing of all is to take the enemy's country whole and intact; to shatter and destroy it is not so good. So, too, it is better to recapture an army entire than to destroy it, to capture a regiment, a detachment or a company entire than to destroy them."
        },
        {
          "lineNumber":2,
          "text":"Hence to fight and conquer in all your battles is not supreme excellence; supreme excellence consists in breaking the enemy's resistance without fighting."
        },
        {
          "lineNumber":3,
          "text":"Thus the highest form of generalship is to balk the enemy's plans; the next best is to prevent the junction of the enemy's forces; the next in order is to attack the enemy's army in the field; and the worst policy of all is to besiege walled cities."
        },
        {
          "lineNumber":4,
          "text":"The rule is, not to besiege walled cities if it can possibly be avoided.The preparation of mantlets, movable shelters, and various implements of war, will take up three whole months; and the piling up of mounds over against the walls will take three months more."
        },
        {
          "lineNumber":5,
          "text":"The general, unable to control his irritation, will launch his men to the assault like swarming ants, with the result that one-third of his men are slain, while the town still remains untaken. Such are the disastrous effects of a siege."
        },
        {
          "lineNumber":6,
          "text":"Therefore the skillful leader subdues the enemy's troops without any fighting; he captures their cities without laying siege to them; he overthrows their kingdom without lengthy operations in the field."
        },
        {
          "lineNumber":7,
          "text":"With his forces intact he will dispute the mastery of the Empire, and thus, without losing a man, his triumph will be complete. This is the method of attacking by stratagem."
        },
        {
          "lineNumber":8,
          "text":"It is the rule in war, if our forces are ten to the enemy's one, to surround him; if five to one, to attack him; if twice as numerous, to divide our army into two"
        },
        {
          "lineNumber":9,
          "text":"If equally matched, we can offer battle; if slightly inferior in numbers, we can avoid the enemy; if quite unequal in every way, we can flee from him."
        },
        {
          "lineNumber":10,
          "text":"Hence, though an obstinate fight may be made by a small force, in the end it must be captured by the larger force."
        },
        {
          "lineNumber":11,
          "text":"Now the general is the bulwark of the State; if the bulwark is complete at all points; the State will be strong; if the bulwark is defective, the State will be weak."
        },
        {
          "lineNumber":12,
          "text":"There are three ways in which a ruler can bring misfortune upon his army"
        },
        {
          "lineNumber":13,
          "text":"(1) By commanding the army to advance or to retreat, being ignorant of the fact that it cannot obey. This is called hobbling the army"
        },
        {
          "lineNumber":14,
          "text":"(2) By attempting to govern an army in the same way as he administers a kingdom, being ignorant of the conditions which obtain in an army. This causes restlessness in the soldier's minds."
        },
        {
          "lineNumber":15,
          "text":"(3) By employing the officers of his army without discrimination, through ignorance of the military principle of adaptation to circumstances. This shakes the confidence of the soldiers."
        },
        {
          "lineNumber":16,
          "text":"But when the army is restless and distrustful, trouble is sure to come from the other feudal princes. This is simply bringing anarchy into the army, and flinging victory away."
        },
        {
          "lineNumber":17,
          "text":"Thus we may know that there are five essentials for victory: (1) He will win who knows when to fight and when not to fight. (2) He will win who knows how to handle both superior and inferior forces. (3) He will win whose army is animated by the same spirit throughout all its ranks. (4) He will win who, prepared himself, waits to take the enemy unprepared. (5) He will win who has military capacity and is not interfered with by the sovereign."
        },
        {
          "lineNumber":18,
          "text":"Hence the saying: If you know the enemy and know yourself, you need not fear the result of a hundred battles. If you know yourself but not the enemy, for every victory gained you will also suffer a defeat. If you know neither the enemy nor yourself, you will succumb in every battle."
        }                  
      ]
    },
    {
      "chapter":4,
      "title":"Tactical Dispositions",
      "content":[
        {
          "lineNumber":1,
          "text":"Sun Tzu said: The good fighters of old first put themselves beyond the possibility of defeat, and then waited for an opportunity of defeating the enemy."
        },
        {
          "lineNumber":2,
          "text":"To secure ourselves against defeat lies in our own hands, but the opportunity of defeating the enemy is provided by the enemy himself."
        },
        {
          "lineNumber":3,
          "text":"Thus the good fighter is able to secure himself against defeat, but cannot make certain of defeating the enemy."
        },
        {
          "lineNumber":4,
          "text":"Hence the saying: One may KNOW how to conquer without being able to DO it."
        },
        {
          "lineNumber":5,
          "text":"Security against defeat implies defensive tactics; ability to defeat the enemy means taking the offensive."
        },
        {
          "lineNumber":6,
          "text":"Standing on the defensive indicates insufficient strength; attacking, a superabundance of strength."
        },
        {
          "lineNumber":7,
          "text":"The general who is skilled in defense hides in the most secret recesses of the earth; he who is skilled in attack flashes forth from the topmost heights of heaven."
        },
        {
          "lineNumber":8,
          "text":"To see victory only when it is within the ken of the common herd is not the acme of excellence."
        },
        {
          "lineNumber":9,
          "text":"Neither is it the acme of excellence if you fight and conquer and the whole Empire says, \"Well done!\" "
        },
        {
          "lineNumber":10,
          "text":"To lift an autumn hair is no sign of great strength; to see the sun and moon is no sign of sharp sight; to hear the noise of thunder is no sign of a quick ear."
        },
        {
          "lineNumber":11,
          "text":"What the ancients called a clever fighter is one who not only wins, but excels in winning with ease."
        },
        {
          "lineNumber":12,
          "text":"Hence his victories bring him neither reputation for wisdom nor credit for courage."
        },
        {
          "lineNumber":13,
          "text":"He wins his battles by making no mistakes. Making no mistakes is what establishes the certainty of victory, for it means conquering an enemy that is already defeated."
        },
        {
          "lineNumber":14,
          "text":"Hence the skillful fighter puts himself into a position which makes defeat impossible, and does not miss the moment for defeating the enemy."
        },
        {
          "lineNumber":15,
          "text":"Thus it is that in war the victorious strategist only seeks battle after the victory has been won, whereas he who is destined to defeat first fights and afterwards looks for victory."
        },
        {
          "lineNumber":16,
          "text":"The consummate leader cultivates the moral law, and strictly adheres to method and discipline; thus it is in his power to control success."
        },
        {
          "lineNumber":17,
          "text":"In respect of military method, we have, firstly, Measurement; secondly, Estimation of quantity; thirdly,Calculation; fourthly, Balancing of chances; fifthly, Victory."
        },
        {
          "lineNumber":18,
          "text":"Measurement owes its existence to Earth; Estimation of quantity to Measurement; Calculation to Estimation of quantity; Balancing of chances to Calculation; and Victory to Balancing of chances."
        },
        {
          "lineNumber":19,
          "text":"A victorious army opposed to a routed one, is as a pound's weight placed in the scale against a single grain."
        },
        {
          "lineNumber":20,
          "text":"The onrush of a conquering force is like the bursting of pent-up waters into a chasm a thousand fathoms deep"
        }                       
      ]
    },
    {
      "chapter":5,
      "title":"Energy",
      "content":[
        {
          "lineNumber":1,
          "text":"Sun Tzu said: The control of a large force is the same principle as the control of a few men: it is merely a question of dividing up their numbers."
        },
        {
          "lineNumber":2,
          "text":"Fighting with a large army under your command is nowise different from fighting with a small one: it is merely a question of instituting signs and signals."
        },
        {
          "lineNumber":3,
          "text":"To ensure that your whole host may withstand the brunt of the enemy's attack and remain unshaken - this is effected by maneuvers direct and indirect."
        },
        {
          "lineNumber":4,
          "text":"That the impact of your army may be like a grindstone dashed against an egg - this is effected by the science of weak points and strong."
        },
        {
          "lineNumber":5,
          "text":"In all fighting, the direct method may be used for joining battle, but indirect methods will be needed in order to secure victory."
        },
        {
          "lineNumber":6,
          "text":"Indirect tactics, efficiently applied, are inexhausible as Heaven and Earth, unending as the flow of rivers and streams; like the sun and moon, they end but to begin anew; like the four seasons, they pass away to return once more."
        },
        {
          "lineNumber":7,
          "text":"There are not more than five musical notes, yet the combinations of these five give rise to more melodies than can ever be heard."
        }, 
        {
          "lineNumber":8,
          "text":"There are not more than five primary colors (blue, yellow, red, white, and black), yet in combination they produce more hues than can ever been seen."
        },
        {
          "lineNumber":9,
          "text":"There are not more than five cardinal tastes (sour, acrid, salt, sweet, bitter), yet combinations of them yield more flavors than can ever be tasted."
        },
        {
          "lineNumber":10,
          "text":"In battle, there are not more than two methods of attack - the direct and the indirect; yet these two in combination give rise to an endless series of maneuvers."
        },
        {
          "lineNumber":11,
          "text":"The direct and the indirect lead on to each other in turn. It is like moving in a circle - you never come to an end. Who can exhaust the possibilities of their combination?"
        },
        {
          "lineNumber":12,
          "text":"The onset of troops is like the rush of a torrent which will even roll stones along in its course."
        },
        {
          "lineNumber":13,
          "text":"The quality of decision is like the well-timed swoop of a falcon which enables it to strike and destroy its victim."
        },
        {
          "lineNumber":14,
          "text":"Therefore the good fighter will be terrible in his onset, and prompt in his decision"
        },
        {
          "lineNumber":15,
          "text":"Energy may be likened to the bending of a crossbow; decision, to the releasing of a trigger."
        },
        {
          "lineNumber":16,
          "text":"Amid the turmoil and tumult of battle, there may be seeming disorder and yet no real disorder at all; amid confusion and chaos, your array may be without head or tail, yet it will be proof against defeat."
        },
        {
          "lineNumber":17,
          "text":"Simulated disorder postulates perfect discipline, simulated fear postulates courage; simulated weakness postulates strength."
        },
        {
          "lineNumber":18,
          "text":"Hiding order beneath the cloak of disorder is simply a question of subdivision; concealing courage under a show of timidity presupposes a fund of latent energy; masking strength with weakness is to be effected by tactical dispositions."
        },
        {
          "lineNumber":19,
          "text":"Thus one who is skillful at keeping the enemy on the move maintains deceitful appearances, according to which the enemy will act."
        },
        {
          "lineNumber":20,
          "text":"By holding out baits, he keeps him on the march; then with a body of picked men he lies in wait for him. Hence his ability to pick out the right men and utilize combined energy."
        },
        {
          "lineNumber":21,
          "text":"The clever combatant looks to the effect of combined energy, and does not require too much fromm individuals."
        },
        {
          "lineNumber":22,
          "text":"When he utilizes combined energy, his fighting men become as it were like unto rolling logs or stones. For it is the nature of a log or stone to remain motionless on level ground, and to move when on a slope; if four-cornered, to come to a standstill, but if round-shaped, to go rolling down."
        },
        {
          "lineNumber":23,
          "text":"Thus the energy developed by good fighting men is as the momentum of a round stone rolled down a mountain thousands of feet in height. So much on the subject of energy."
        }             
      ]
    },
    {
      "chapter":6,
      "title":"Weak Points and Strong",
      "content":[
        {
          "lineNumber":1,
          "text":"Sun Tzu said: Whoever is first in the field and awaits the coming of the enemy, will be fresh for the fight; whoever is second in the field and has to hasten to battle will arrive exhausted."
        },
        {
          "lineNumber":2,
          "text":"Having collected an army and concentrated his forces, he must blend and harmonize the different elements thereof before pitching his camp."
        },
        {
          "lineNumber":3,
          "text":"After that, comes tactical maneuvering, than which there is nothing more difficult. The difficulty of tactical maneuvering consists in turning the devious into the direct, and misfortune into gain."
        },
        {
          "lineNumber":4,
          "text":"Thus, to take a long and circuitous route, after enticing the enemy out of the way, and though starting after him, to contrive to reach the goal before him, shows knowledge of the artifice of DEVIATION."
        },
        {
          "lineNumber":5,
          "text":"Maneuvering with an army is advantageous; with an undisciplined multitude, most dangerous."
        },
        {
          "lineNumber":6,
          "text":"If you set a fully equipped army in march in order to snatch an advantage, the chances are that you will be too late. On the other hand, to detach a flying column for the purpose involves the sacrifice of its baggage and stores."
        },
        {
          "lineNumber":7,
          "text":"Thus, if you order your men to roll up their buff-coats, and make forced marches without halting day or night, covering double the usual distance at a stretch, doing a hundred LI in order to wrest an advantage, the leaders of all your three divisions will fall into the hands of the enemy."
        },
        {
          "lineNumber":8,
          "text":"The stronger men will be in front, the jaded ones will fall behind, and on this plan only one-tenth of your army will reach its destination."
        },
        {
          "lineNumber":9,
          "text":"If you march fifty LI in order to outmaneuver the enemy, you will lose the leader of your first division, and only half your force will reach the goal."
        },
        {
          "lineNumber":10,
          "text":"If you march thirty LI with the same object, two-thirds of your army will arrive."
        },
        {
          "lineNumber":11,
          "text":"We may take it then that an army without its baggage- train is lost; without provisions it is lost; without bases of supply it is lost."
        },
        {
          "lineNumber":12,
          "text":"We cannot enter into alliances until we are acquainted with the designs of our neighbors."
        },
        {
          "lineNumber":13,
          "text":"We are not fit to lead an army on the march unless we are familiar with the face of the country--its mountains and forests, its pitfalls and precipices, its marshes and swamps."
        },
        {
          "lineNumber":14,
          "text":"We shall be unable to turn natural advantage to account unless we make use of local guides."
        },
        {
          "lineNumber":15,
          "text":"In war, practice dissimulation, and you will succeed."
        },
        {
          "lineNumber":16,
          "text":"Whether to concentrate or to divide your troops, must be decided by circumstances."
        },
        {
          "lineNumber":17,
          "text":"Let your rapidity be that of the wind, your compactness that of the forest."
        },
        {
          "lineNumber":18,
          "text":"In raiding and plundering be like fire, is immovability like a mountain."
        },
        {
          "lineNumber":19,
          "text":"Let your plans be dark and impenetrable as night, and when you move, fall like a thunderbolt."
        },
        {
          "lineNumber":20,
          "text":"When you plunder a countryside, let the spoil be divided amongst your men; when you capture new territory, cut it up into allotments for the benefit of the soldiery."
        },
        {
          "lineNumber":21,
          "text":"Ponder and deliberate before you make a move."
        },
        {
          "lineNumber":23,
          "text":"He will conquer who has learnt the artifice of deviation."
        },
        {
          "lineNumber":24,
          "text":"Gongs and drums, banners and flags, are means whereby the ears and eyes of the host may be focused on one particular point."
        },
        {
          "lineNumber":25,
          "text":"The host thus forming a single united body, is it impossible either for the brave to advance alone, or for the cowardly to retreat alone. This is the art of handling large masses of men."
        },
        {
          "lineNumber":26,
          "text":"In night-fighting, then, make much use of signal-fires and drums, and in fighting by day, of flags and banners, as a means of influencing the ears and eyes of your army."
        },
        {
          "lineNumber":27,
          "text":"A whole army may be robbed of its spirit; "
        },
        {
          "lineNumber":28,
          "text":"Now a soldier's spirit is keenest in the morning; by noonday it has begun to flag; and in the evening, his mind is bent only on returning to camp."
        },
        {
          "lineNumber":29,
          "text":"A clever general, therefore, avoids an army when its spirit is keen, but attacks it when it is sluggish and inclined to return. This is the art of studying moods."
        },
        {
          "lineNumber":30,
          "text":"To be near the goal while the enemy is still far from it, to wait at ease while the enemy is toiling and struggling, to be well-fed while the enemy is famished:--this is the art of husbanding one's strength."
        },
        {
          "lineNumber":31,
          "text":"To be near the goal while the enemy is still far from it, to wait at ease while the enemy is toiling and struggling, to be well-fed while the enemy is famished:--this is the art of husbanding one's strength."
        },
        {
          "lineNumber":32,
          "text":"To refrain from intercepting an enemy whose banners are in perfect order, to refrain from attacking an army drawn up in calm and confident array:--this is the art of studying circumstances."
        },
        {
          "lineNumber":33,
          "text":"It is a military axiom not to advance uphill against the enemy, nor to oppose him when he comes downhill."
        },
        {
          "lineNumber":34,
          "text":"Do not pursue an enemy who simulates flight; do not attack soldiers whose temper is keen."
        },        
        {
          "lineNumber":35,
          "text":"Do not swallow bait offered by the enemy. Do not interfere with an army that is returning home."
        },        
        {
          "lineNumber":36,
          "text":"When you surround an army, leave an outlet free. Do not press a desperate foe too hard."
        },        
        {
          "lineNumber":37,
          "text":"Such is the art of warfare."
        }                                        
      ]
    }
  ]
}